# FbxLightEmitShapeVisible Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightEmitShapeVisible Property
ParameterTypeId Class See Also
---
"Emit Shape Visible in Rendering"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightEmitShapeVisible { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightEmitShapeVisible As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightEmitShapeVisible {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace